from datetime import timedelta


class Config(object):
    DEBUG = False
    SECRET_KEY = 'liujinji'
    DIALECT = 'mysql'  # 链接类型
    DRIVER = 'pymysql'  # 链接库
    USERNAME = 'root'  # 登录名
    PASSWORD = ''  # 登录密码
    HOST = ''  # 主机地址
    PORT = 10008  # 端口
    DATABASE = 'caketest'  # 数据库
    SQLALCHEMY_TRACK_MODIFICATIONS = True
    SQLALCHEMY_DATABASE_URI = '''{}+{}://{}:{}@{}:{}/{}?charset=utf8'''.format(
        DIALECT, DRIVER, USERNAME, PASSWORD, HOST, PORT, DATABASE)
    PERMANENT_SESSION_LIFETIME = timedelta(minutes=10)


class DepartmentMap(object):
    DEPART = {"1": "采购与招标管理中心", "2": "藏学学院", "3": "城市规划与建筑学院", "4": "创新创业学院", "5": "档案馆", "6": "党委教师工作部、人事处、人才工作办公室",
              "7": "党委统战部", "8": "党委组织部、机关党委、党校", "9": "党委组织部、机关党委、党校/人才流动服务中心", "10": "电气信息工程学院", "11": "对外联络办公室",
              "12": "发展规划与学科建设处", "13": "法学院", "14": "高等教育研究中心", "15": "管理学院", "16": "国际合作与交流处、港澳台办公室、国际教育学院",
              "17": "国有资产管理处", "18": "后勤管理处", "19": "后勤管理处/工程维修服务部", "20": "化学与环境保护工程学院", "21": "基建处", "22": "计划财务处",
              "23": "计算机科学与技术学院", "24": "纪委办公室、监察处", "25": "继续教育学院、职业技术学院、民族干部培训中心", "26": "教师教学发展中心", "27": "教务处",
              "28": "经济学院", "29": "科技处、社会科学处", "30": "离退休工作处", "31": "旅游与历史文化学院", "32": "马克思主义学院（哲学学院）", "33": "民族博物馆",
              "34": "期刊社", "35": "青藏高原研究院", "36": "社会学与心理学学院", "37": "审计处", "38": "生命科学与技术学院", "39": "实验室与设备管理处",
              "40": "体育学院", "41": "图书馆", "42": "图书馆/流通部", "43": "外国语学院", "44": "文学与新闻传播学院", "45": "武装部、保卫处",
              "46": "西南民族研究院", "47": "校工会", "48": "校领导", "49": "校团委", "50": "校医院", "51": "信息与教育技术中心",
              "52": "宣传部、新闻中心、新闻办公室、对外宣传办公室", "53": "学党委学生工作部、学生处、学生资助管理中心", "54": "学校办公室（党委办公室、校长办公室）",
              "55": "学校办公室（党委办公室、校长办公室）/督办科", "56": "研究生工作部、研究生院", "57": "药学院", "58": "彝学学院", "59": "艺术学院",
              "60": "预科教育学院", "61": "招生就业处", "62": "资产经营有限责任公司"}
    F_DEPART = {"采购与招标管理中心": 1, "藏学学院": 2, "城市规划与建筑学院": 3, "创新创业学院": 4, "档案馆": 5, "党委教师工作部、人事处、人才工作办公室": 6, "党委统战部": 7,
                "党委组织部、机关党委、党校": 8, "党委组织部、机关党委、党校/人才流动服务中心": 9, "电气信息工程学院": 10, "对外联络办公室": 11, "发展规划与学科建设处": 12,
                "法学院": 13, "高等教育研究中心": 14, "管理学院": 15, "国际合作与交流处、港澳台办公室、国际教育学院": 16, "国有资产管理处": 17, "后勤管理处": 18,
                "后勤管理处/工程维修服务部": 19, "化学与环境保护工程学院": 20, "基建处": 21, "计划财务处": 22, "计算机科学与技术学院": 23, "纪委办公室、监察处": 24,
                "继续教育学院、职业技术学院、民族干部培训中心": 25, "教师教学发展中心": 26, "教务处": 27, "经济学院": 28, "科技处、社会科学处": 29, "离退休工作处": 30,
                "旅游与历史文化学院": 31, "马克思主义学院（哲学学院）": 32, "民族博物馆": 33, "期刊社": 34, "青藏高原研究院": 35, "社会学与心理学学院": 36, "审计处": 37,
                "生命科学与技术学院": 38, "实验室与设备管理处": 39, "体育学院": 40, "图书馆": 41, "图书馆/流通部": 42, "外国语学院": 43, "文学与新闻传播学院": 44,
                "武装部、保卫处": 45, "西南民族研究院": 46, "校工会": 47, "校领导": 48, "校团委": 49, "校医院": 50, "信息与教育技术中心": 51,
                "宣传部、新闻中心、新闻办公室、对外宣传办公室": 52, "学党委学生工作部、学生处、学生资助管理中心": 53, "学校办公室（党委办公室、校长办公室）": 54,
                "学校办公室（党委办公室、校长办公室）/督办科": 55, "研究生工作部、研究生院": 56, "药学院": 57, "彝学学院": 58, "艺术学院": 59, "预科教育学院": 60,
                "招生就业处": 61, "资产经营有限责任公司": 62}
